import React from 'react';

const Disclaimer = () => {
  return (
    <div>
      <div className="box">
        <h1>免責聲明</h1>

        <p>
          <a href="https://pinkoi.com">O.HI.O</a>{' '}
          僅係提供會員間（即消費者與設計師）交易之平台，刊登之商品是由設計師自行上傳銷售，消費者於
          O.HI.O 完成選購商品並付款後，買賣契約成立於消費者與設計師之間，O.HI.O
          無法，亦不會介入、干涉設計師與消費者間買賣交易。若消費者就其選購之商品後續衍生消費爭議，需由消費者與設計師間自行處理及解決。
        </p>
        <p>
          如消費者於 O.HI.O
          選購商品產生消費爭議（如：設計師拒絕履行出貨、售後服務、付款糾紛或避不出面等），O.HI.O
          將盡力協助消費者與設計師聯繫，必要時得將設計師聯絡方式（公司、個人名稱、電話、email）提供予消費者，然此不代表
          O.HI.O
          就設計師與消費者間之消費爭議有介入處理義務，亦不就消費爭議衍生之法律責任與其中一方連帶負責。
        </p>
        <p>
          關於設計師及設計館上架內容與商品資訊，消費者如有疑問，應逕透過 O.HI.O
          聯絡設計師、傳送訊息等功能向設計師聯繫、詢問，相關法律責任亦應由該設計師自行負責。O.HI.O
          對於設計師上架內容與商品資訊並不負任何法律上之保證、擔保或連帶賠償責任。
        </p>
        <p>
          您明確了解並同意 O.HI.O
          提供之網路服務（包含但不限於網站及手機版網頁及手機應用程式等）、資料庫系統及程式設計（下稱「本服務」）僅以「現狀」提供服務，O.HI.O不保證以下事項：A.本服務符合使用者的需求；B.本服務內容及系統程式不受干擾、及時提供或免於出錯；C.您經由本服務購買之商品或服務將符合您的期望；D.所有會員自行填寫資料之正確性。且
          O.HI.O 得依其判斷隨時進行規格變更及版本升級，如因此暫時停止網路服務，O.HI.O
          不對消費者為任何賠償。
        </p>
        <p>
          本服務指定之第三方服務（包含但不限於銀行或超商），所提供之服務品質及
          內容由該第三方自行負責。故使用本服務時，可能由於第三方本身系統問題、相關作業網路連線品質問題或其他不可抗拒因素，造成驗證無法完成。若您所提供之基本資料有誤，造成本服務無法即時通知您異常狀況之緊急處理方式時，O.HI.O
          對此將不負任何損害賠償責任。
        </p>
        <p>
          O.HI.O 必須提醒消費者：為保障消費者權益，請消費者於 O.HI.O
          上完成交易，如有任何疑問，歡迎來信{' '}
          <a href="mailto:service@pinkoi.com">service@pinkoi.com</a>。
        </p>
      </div>
    </div>
  );
};

export default Disclaimer;
