import React from 'react';

const Selling = () => {
  return (
    <div>
      <div className="box">
        <h1>商品販售政策</h1>
        <p>
          <a href="/">O.HI.O</a>{' '}
          提供網路服務（包含但不限於網站及手機版網頁及手機應用程式等）之目的，在於鼓勵優質設計師將具有原創性之商品或設計品展示於
          O.HI.O，消費者再透過簡單、流暢的介面設計，快速且便利的選購自己喜歡的商品，讓設計師好的創意、好的商品，透過網路推展到國際舞台。
        </p>
        <h2>可上架商品範圍</h2>
        <ol className="no-num">
          <li>
            1. 原創商品：由設計師本人（或其團隊）親自發想、設計之具有原創性，且符合 O.HI.O
            商品販售政策之商品。
          </li>
          <li>
            2.
            授權販售：得到原廠品牌或商品原創者書面授權或擁有其他合法權源，得由設計師代理或經銷之商品。
          </li>
          <li>3. 十年老件：指歷經十年以上時間淬練，狀況良好且數量有限的古董或物品。</li>
        </ol>
        <h2>禁止上架商品範圍</h2>
        <ol data-perfix="2.2.">
          <li>非原創、非授權販售或非十年以上老件之商品。</li>
          <li>
            至各地少量帶貨、批貨而來之非原創商品（沒有授權文件、或拒絕提供授權文件予 O.HI.O
            建檔者）。
          </li>
          <li>與申請開館時類別相異之商品。</li>
          <li>仿冒品、盜版品、可能涉及侵害他人擁有之專利、著作、商標等權利之商品。</li>
          <li>
            違反智慧財產權相關法規及未經肖像所有權人同意使用之創作（包含但不限於卡通虛擬人物、電影人物、名人等圖像及肖像）
          </li>
          <li>無法提供相應投保證明、教練證書之體驗活動商品。</li>
          <li>於住家、民宅等非公眾得出入之場所舉辦或場地未能符合法規要求之體驗活動商品。</li>
          <li>
            使用一般市售素材（包含但不限於羊毛氈、黏土、毛線、橡皮筋等材料），並依照網路範例、市售教學書之程序重現（製）不具有原創性之商品。
          </li>
          <li>不開放消費者購買之展示品。</li>
          <li>租借性質之商品。</li>
          <li>廣告性質之商品。</li>
          <li>菸酒管理法所定義之菸類及酒精類及其製成物。</li>
          <li>毒品／吸毒用品，包括麻醉劑、類固醇和其他管制藥品。</li>
          <li>含有輻射性物質、易燃物、有毒物質之商品，包括含有該物質廢棄物。</li>
          <li>藥品／未經 O.HI.O 審核的醫療器材。</li>
          <li>活體動物／保育類動物及其產製品（如：象牙製品、熊掌）。</li>
          <li>爆竹煙火。</li>
          <li>武器（如：槍，砲，彈藥，子彈，爆裂物）。</li>
          <li>有害物質（如：易燃，易爆，腐蝕，有毒）。</li>
          <li>房地產／具牌照之交通工具（如：汽車，摩托車，遊艇）。</li>
          <li>贓物／無處分權物（如：權利車）。</li>
          <li>個人情報資料（如：通訊錄、個人身份資料）。</li>
          <li>政府證明文件或執照、身分證、護照、警用物品、以及其他執法機關制服裝或徽章。</li>
          <li>統一發票、銷售憑證、捐贈收據或證明以及賭博性商品、彩券。</li>
          <li>貨幣／有價證券（如：股票股條，認股權證，債券，不動產投資證券）。</li>
          <li>含有或暗示色情或猥褻意涵之商品。</li>
          <li>含有或暗示暴力意涵之商品。</li>
          <li>針對特定人物人身攻擊或含有歧視意涵之商品。</li>
          <li>帶有攻擊或有歧視種族、宗教、性別認同、殘疾意涵或鼓吹犯罪之商品。</li>
          <li>其他違反公共秩序、善良風俗或依法令禁止販售、廣告之商品。</li>
          <li>其他經 O.HI.O 判斷認為不符 O.HI.O 商品販售政策之商品。</li>
        </ol>
      </div>
    </div>
  );
};

export default Selling;
